OpenFOAM/run/interFlow/floatingObject/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Set application name
application=$(getApplication)

rm rf 0
cp -r 0.orig 0
runApplication blockMesh
runApplication topoSet
runApplication subsetMesh -overwrite c0 -patch floatingObject
runApplication setFields
runApplication $application

#------------------------------------------------------------------------------
